# Working with missing data

## Data set

We'll clean and analyze data on passenger survival from the Titanic. Each row contains information for a specific Titanic passenger.

Lets take a closer look at a few of the key columns:

* pclass -- The passenger's cabin class from 1 to 3 where 1 was the highest class
* survived -- 1 if the passenger survived, and 0 if they did not.
* sex -- The passenger's gender
* age -- The passenger's age
* fare -- The amount the passenger paid for their ticket
* embarked -- Either C, Q, or S, to indicate which port the passenger boarded the ship from.

Many of the columns, such as age and sex, have missing values.

**Because missing values** can cause errors in numerical functions, we'll need to deal with them before we can analyze the data. For instance, finding the mean of a column with a missing value will fail because it's impossible to average a missing value. Addressing missing values will let us perform calculations on the entire data set.

In [2]:
# Import data into a panda dataframe
import pandas as pd
import numpy as np
titanic_survival = pd.read_csv("titanic_survival.csv")

print(titanic_survival)

      pclass  survived                                               name  \
0        1.0       1.0                      Allen, Miss. Elisabeth Walton
1        1.0       1.0                     Allison, Master. Hudson Trevor
2        1.0       0.0                       Allison, Miss. Helen Loraine
3        1.0       0.0               Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5        1.0       1.0                                Anderson, Mr. Harry
6        1.0       1.0                  Andrews, Miss. Kornelia Theodosia
7        1.0       0.0                             Andrews, Mr. Thomas Jr
8        1.0       1.0      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9        1.0       0.0                            Artagaveytia, Mr. Ramon
10       1.0       0.0                             Astor, Col. John Jacob
11       1.0       1.0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1.0       1.0                      Aubart, Mme. Leontine Pauline
13       1.0       1.0                       Barber, Miss. Ellen "Nellie"
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
15       1.0       0.0                                Baumann, Mr. John D
16       1.0       0.0                           Baxter, Mr. Quigg Edmond
17       1.0       1.0    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18       1.0       1.0                              Bazzani, Miss. Albina
19       1.0       0.0                               Beattie, Mr. Thomson
20       1.0       1.0                      Beckwith, Mr. Richard Leonard
21       1.0       1.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22       1.0       1.0                              Behr, Mr. Karl Howell
23       1.0       1.0                              Bidois, Miss. Rosalie
24       1.0       1.0                                  Bird, Miss. Ellen
25       1.0       0.0                                Birnbaum, Mr. Jakob
26       1.0       1.0                            Bishop, Mr. Dickinson H
27       1.0       1.0            Bishop, Mrs. Dickinson H (Helen Walton)
28       1.0       1.0                             Bissette, Miss. Amelia
29       1.0       1.0          Bjornstrom-Steffansson, Mr. Mauritz Hakan
...      ...       ...                                                ...
1280     3.0       0.0                                    Vovk, Mr. Janko
1281     3.0       0.0                               Waelens, Mr. Achille
1282     3.0       0.0                                Ware, Mr. Frederick
1283     3.0       0.0                        Warren, Mr. Charles William
1284     3.0       0.0                                  Webber, Mr. James
1285     3.0       0.0                                Wenzel, Mr. Linhart
1286     3.0       1.0    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1287     3.0       0.0                   Widegren, Mr. Carl/Charles Peter
1288     3.0       0.0                          Wiklund, Mr. Jakob Alfred
1289     3.0       0.0                            Wiklund, Mr. Karl Johan
1290     3.0       1.0                   Wilkes, Mrs. James (Ellen Needs)
1291     3.0       0.0                   Willer, Mr. Aaron ("Abi Weller")
1292     3.0       0.0                                 Willey, Mr. Edward
1293     3.0       0.0                  Williams, Mr. Howard Hugh "Harry"
1294     3.0       0.0                               Williams, Mr. Leslie
1295     3.0       0.0                                Windelov, Mr. Einar
1296     3.0       0.0                                   Wirz, Mr. Albert
1297     3.0       0.0                             Wiseman, Mr. Phillippe
1298     3.0       0.0                          Wittevrongel, Mr. Camille
1299     3.0       0.0                                Yasbeck, Mr. Antoni
1300     3.0       1.0            Yasbeck, Mrs. Antoni (Selini Alexander)
1301     3.0       0.0                               Youseff, Mr. Gerious
1302     3.0       0.0                                  Yousif, Mr. Wazli
1303     3.0       0.0                              Yousseff, Mr. Gerious
1304     3.0       0.0                               Zabour, Miss. Hileni
1305     3.0       0.0                              Zabour, Miss. Thamine
1306     3.0       0.0                          Zakarian, Mr. Mapriededer
1307     3.0       0.0                                Zakarian, Mr. Ortin
1308     3.0       0.0                                 Zimmerman, Mr. Leo
1309     NaN       NaN                                                NaN

         sex      age  sibsp  parch            ticket      fare    cabin  \
0     female  29.0000    0.0    0.0             24160  211.3375       B5
1       male   0.9167    1.0    2.0            113781  151.5500  C22 C26
2     female   2.0000    1.0    2.0            113781  151.5500  C22 C26
3       male  30.0000    1.0    2.0            113781  151.5500  C22 C26
4     female  25.0000    1.0    2.0            113781  151.5500  C22 C26
5       male  48.0000    0.0    0.0             19952   26.5500      E12
6     female  63.0000    1.0    0.0             13502   77.9583       D7
7       male  39.0000    0.0    0.0            112050    0.0000      A36
8     female  53.0000    2.0    0.0             11769   51.4792     C101
9       male  71.0000    0.0    0.0          PC 17609   49.5042      NaN
10      male  47.0000    1.0    0.0          PC 17757  227.5250  C62 C64
11    female  18.0000    1.0    0.0          PC 17757  227.5250  C62 C64
12    female  24.0000    0.0    0.0          PC 17477   69.3000      B35
13    female  26.0000    0.0    0.0             19877   78.8500      NaN
14      male  80.0000    0.0    0.0             27042   30.0000      A23
15      male      NaN    0.0    0.0          PC 17318   25.9250      NaN
16      male  24.0000    0.0    1.0          PC 17558  247.5208  B58 B60
17    female  50.0000    0.0    1.0          PC 17558  247.5208  B58 B60
18    female  32.0000    0.0    0.0             11813   76.2917      D15
19      male  36.0000    0.0    0.0             13050   75.2417       C6
20      male  37.0000    1.0    1.0             11751   52.5542      D35
21    female  47.0000    1.0    1.0             11751   52.5542      D35
22      male  26.0000    0.0    0.0            111369   30.0000     C148
23    female  42.0000    0.0    0.0          PC 17757  227.5250      NaN
24    female  29.0000    0.0    0.0          PC 17483  221.7792      C97
25      male  25.0000    0.0    0.0             13905   26.0000      NaN
26      male  25.0000    1.0    0.0             11967   91.0792      B49
27    female  19.0000    1.0    0.0             11967   91.0792      B49
28    female  35.0000    0.0    0.0          PC 17760  135.6333      C99
29      male  28.0000    0.0    0.0            110564   26.5500      C52
...      ...      ...    ...    ...               ...       ...      ...
1280    male  22.0000    0.0    0.0            349252    7.8958      NaN
1281    male  22.0000    0.0    0.0            345767    9.0000      NaN
1282    male      NaN    0.0    0.0            359309    8.0500      NaN
1283    male      NaN    0.0    0.0        C.A. 49867    7.5500      NaN
1284    male      NaN    0.0    0.0  SOTON/OQ 3101316    8.0500      NaN
1285    male  32.5000    0.0    0.0            345775    9.5000      NaN
1286  female  38.0000    0.0    0.0              2688    7.2292      NaN
1287    male  51.0000    0.0    0.0            347064    7.7500      NaN
1288    male  18.0000    1.0    0.0           3101267    6.4958      NaN
1289    male  21.0000    1.0    0.0           3101266    6.4958      NaN
1290  female  47.0000    1.0    0.0            363272    7.0000      NaN
1291    male      NaN    0.0    0.0              3410    8.7125      NaN
1292    male      NaN    0.0    0.0     S.O./P.P. 751    7.5500      NaN
1293    male      NaN    0.0    0.0          A/5 2466    8.0500      NaN
1294    male  28.5000    0.0    0.0             54636   16.1000      NaN
1295    male  21.0000    0.0    0.0  SOTON/OQ 3101317    7.2500      NaN
1296    male  27.0000    0.0    0.0            315154    8.6625      NaN
1297    male      NaN    0.0    0.0        A/4. 34244    7.2500      NaN
1298    male  36.0000    0.0    0.0            345771    9.5000      NaN
1299    male  27.0000    1.0    0.0              2659   14.4542      NaN
1300  female  15.0000    1.0    0.0              2659   14.4542      NaN
1301    male  45.5000    0.0    0.0              2628    7.2250      NaN
1302    male      NaN    0.0    0.0              2647    7.2250      NaN
1303    male      NaN    0.0    0.0              2627   14.4583      NaN
1304  female  14.5000    1.0    0.0              2665   14.4542      NaN
1305  female      NaN    1.0    0.0              2665   14.4542      NaN
1306    male  26.5000    0.0    0.0              2656    7.2250      NaN
1307    male  27.0000    0.0    0.0              2670    7.2250      NaN
1308    male  29.0000    0.0    0.0            315082    7.8750      NaN
1309     NaN      NaN    NaN    NaN               NaN       NaN      NaN

     embarked boat   body                           home.dest
0           S    2    NaN                        St Louis, MO
1           S   11    NaN     Montreal, PQ / Chesterville, ON
2           S  NaN    NaN     Montreal, PQ / Chesterville, ON
3           S  NaN  135.0     Montreal, PQ / Chesterville, ON
4           S  NaN    NaN     Montreal, PQ / Chesterville, ON
5           S    3    NaN                        New York, NY
6           S   10    NaN                          Hudson, NY
7           S  NaN    NaN                         Belfast, NI
8           S    D    NaN                 Bayside, Queens, NY
9           C  NaN   22.0                 Montevideo, Uruguay
10          C  NaN  124.0                        New York, NY
11          C    4    NaN                        New York, NY
12          C    9    NaN                       Paris, France
13          S    6    NaN                                 NaN
14          S    B    NaN                       Hessle, Yorks
15          S  NaN    NaN                        New York, NY
16          C  NaN    NaN                        Montreal, PQ
17          C    6    NaN                        Montreal, PQ
18          C    8    NaN                                 NaN
19          C    A    NaN                        Winnipeg, MN
20          S    5    NaN                        New York, NY
21          S    5    NaN                        New York, NY
22          C    5    NaN                        New York, NY
23          C    4    NaN                                 NaN
24          S    8    NaN                                 NaN
25          C  NaN  148.0                   San Francisco, CA
26          C    7    NaN                        Dowagiac, MI
27          C    7    NaN                        Dowagiac, MI
28          S    8    NaN                                 NaN
29          S    D    NaN  Stockholm, Sweden / Washington, DC
...       ...  ...    ...                                 ...
1280        S  NaN    NaN                                 NaN
1281        S  NaN    NaN      Antwerp, Belgium / Stanton, OH
1282        S  NaN    NaN                                 NaN
1283        S  NaN    NaN                                 NaN
1284        S  NaN    NaN                                 NaN
1285        S  NaN  298.0                                 NaN
1286        C    C    NaN                                 NaN
1287        S  NaN    NaN                                 NaN
1288        S  NaN  314.0                                 NaN
1289        S  NaN    NaN                                 NaN
1290        S  NaN    NaN                                 NaN
1291        S  NaN    NaN                                 NaN
1292        S  NaN    NaN                                 NaN
1293        S  NaN    NaN                                 NaN
1294        S  NaN   14.0                                 NaN
1295        S  NaN    NaN                                 NaN
1296        S  NaN  131.0                                 NaN
1297        S  NaN    NaN                                 NaN
1298        S  NaN    NaN                                 NaN
1299        C    C    NaN                                 NaN
1300        C  NaN    NaN                                 NaN
1301        C  NaN  312.0                                 NaN
1302        C  NaN    NaN                                 NaN
1303        C  NaN    NaN                                 NaN
1304        C  NaN  328.0                                 NaN
1305        C  NaN    NaN                                 NaN
1306        C  NaN  304.0                                 NaN
1307        C  NaN    NaN                                 NaN
1308        S  NaN    NaN                                 NaN
1309      NaN  NaN    NaN                                 NaN

[1310 rows x 14 columns]

## Missing data
Missing data can take a few different forms:

* In Python, the `None` keyword and type indicates no value.
* The Pandas library uses `NaN`, which stands for "not a number", to indicate a missing value.

In general terms, both `NaN` and `None` can be called null values.

If we want to see which values are NaN, we can use the `pandas.isnull()` function which takes a pandas series and returns a series of True and False values, the same way that NumPy did when we compared arrays.

In [15]:
titanic_sex = titanic_survival["sex"]
#print(titanic_sex)

titanic_sex_missing = pd.isnull(titanic_sex)
#print(titanic_sex_missing)

sex_null_true = titanic_sex[titanic_sex_missing]
print(sex_null_true)

1309    NaN
Name: sex, dtype: object

In [16]:
age = titanic_survival["age"]
print(age.loc[10:20])

#extract all rows with age = NaN
age_null_true = age[pd.isnull(age)]

#count resulting Dataframe
age_null_count = age_null_true.shape[0]
print(age_null_count)

10    47.0
11    18.0
12    24.0
13    26.0
14    80.0
15     NaN
16    24.0
17    50.0
18    32.0
19    36.0
20    37.0
Name: age, dtype: float64
264

## Calculating Mean

The result of calculating the mean of this age Series this is that mean_age would be `nan`. This is because **any calculations we do with a null value also result in a null value**. This makes sense when you think about it -- how can you add a null value to a known value?

Hence, we have to filter out the missing values before we calculate the mean.

In [31]:
age_is_null = pd.isnull(titanic_survival["age"])
print(age_is_null)

age_not_null = titanic_survival["age"][pd.notnull(age)]

#Alternative: 
age_not_null = titanic_survival["age"][age_is_null == False]

correct_mean_age = age_not_null.mean()
print(correct_mean_age)

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15       True
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1280    False
1281    False
1282     True
1283     True
1284     True
1285    False
1286    False
1287    False
1288    False
1289    False
1290    False
1291     True
1292     True
1293     True
1294    False
1295    False
1296    False
1297     True
1298    False
1299    False
1300    False
1301    False
1302     True
1303     True
1304    False
1305     True
1306    False
1307    False
1308    False
1309     True
Name: age, Length: 1310, dtype: bool
29.8811345124

Luckily, missing data is so common that many pandas methods automatically filter for it. For example, if we use use the `Series.mean()` method to calculate the mean of a column, missing values will not be included in the calculation.

In [33]:
# Same result as the code above: 
correct_mean_age = titanic_survival["age"].mean()
print(correct_mean_age)

29.8811345124

In [46]:
passenger_classes = [1, 2, 3]
fares_by_class = {}

for pc in passenger_classes:
    fares_by_class[pc] = titanic_survival["fare"][titanic_survival["pclass"] == pc].mean()

print(fares_by_class)

{1: 87.508991640866881, 2: 21.179196389891697, 3: 13.302888700564973}

# Pivot tables

Pivot tables provide an easy way to subset by one column and then apply a calculation like a sum or a mean. The concept of Pivot tables was popularized with the introduction of the 'PivotTable' feature in Microsoft Excel in the mid 1990's.

Pivot tables first group and then apply a calculation. In the previous example, we actually made a pivot table manually by grouping by the column "pclass" and then calculating the mean of the "fare" column for each class.

Luckily, we can use the `Dataframe.pivot_table()` method instead, which simplifies the kind of work we did on the last screen. To produce the same data, we could use one line.

In [53]:
passenger_class_fares = titanic_survival.pivot_table(index="pclass", values="fare", aggfunc=np.mean )
print(passenger_class_fares)

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889

In [55]:
# calculate the mean age for each passenger class 
passenger_age = titanic_survival.pivot_table(index="pclass", values="age", aggfunc=np.mean)
print(passenger_age)

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

We can use the `DataFrame.pivot_table()` method to **perform even more advanced tasks**. If we pass a list of column names to the values parameter instead of a single value, we can perform calculations **on multiple columns at once**.

We can also specify a custom calculation to be made. For instance, if we pass `np.sum()` to the aggfunc parameter it will total the values in each column.

In [78]:
# pivot table that calculates the total fares collected ("fare") and total number of survivors ("survived") for each embarkation port("embarked").
port_stats = titanic_survival.pivot_table(index="embarked", values=["fare", "survived"], aggfunc=np.sum)
print(port_stats)

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

In [83]:
port_stats2 = titanic_survival.pivot_table(index=["embarked", "pclass"], values=["survived","sex"], aggfunc=np.sum)
print(port_stats2)

                 survived
embarked pclass
C        1.0         97.0
         2.0         16.0
         3.0         37.0
Q        1.0          2.0
         2.0          2.0
         3.0         40.0
S        1.0         99.0
         2.0        101.0
         3.0        104.0

## Remove missing values in a matrix

We can use the `DataFrame.dropna()` method on pandas DataFrames to do this. The method will drop any rows that contain missing values.

The `dropna()` method takes an axis parameter, which indicates whether you would like to drop rows or columns. 
* Specifying `axis=0` or `axis='index'` will drop any rows that have null values, while 
* specifying `axis=1` or `axis='columns'` will drop any columns that have null values. 

We will use 0 and 1 since they're more commonly used, but you can use either.

In [91]:
# drop all rows in titanic_survival that have null values.
drop_na_rows = titanic_survival.dropna(axis=0)
#print(drop_na_rows)

# Drop all columns in titanic_survival that have missing values and assign the result to drop_na_columns.
drop_na_columns = titanic_survival.dropna(axis=1)
#print(drop_na_columns)

# Drop all rows in titanic_survival where the columns "age" or "sex" have missing values
new_titanic_survival = titanic_survival.dropna(axis=0, subset=["age","sex"])
print(new_titanic_survival)

      pclass  survived                                               name  \
0        1.0       1.0                      Allen, Miss. Elisabeth Walton
1        1.0       1.0                     Allison, Master. Hudson Trevor
2        1.0       0.0                       Allison, Miss. Helen Loraine
3        1.0       0.0               Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5        1.0       1.0                                Anderson, Mr. Harry
6        1.0       1.0                  Andrews, Miss. Kornelia Theodosia
7        1.0       0.0                             Andrews, Mr. Thomas Jr
8        1.0       1.0      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9        1.0       0.0                            Artagaveytia, Mr. Ramon
10       1.0       0.0                             Astor, Col. John Jacob
11       1.0       1.0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1.0       1.0                      Aubart, Mme. Leontine Pauline
13       1.0       1.0                       Barber, Miss. Ellen "Nellie"
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
16       1.0       0.0                           Baxter, Mr. Quigg Edmond
17       1.0       1.0    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18       1.0       1.0                              Bazzani, Miss. Albina
19       1.0       0.0                               Beattie, Mr. Thomson
20       1.0       1.0                      Beckwith, Mr. Richard Leonard
21       1.0       1.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22       1.0       1.0                              Behr, Mr. Karl Howell
23       1.0       1.0                              Bidois, Miss. Rosalie
24       1.0       1.0                                  Bird, Miss. Ellen
25       1.0       0.0                                Birnbaum, Mr. Jakob
26       1.0       1.0                            Bishop, Mr. Dickinson H
27       1.0       1.0            Bishop, Mrs. Dickinson H (Helen Walton)
28       1.0       1.0                             Bissette, Miss. Amelia
29       1.0       1.0          Bjornstrom-Steffansson, Mr. Mauritz Hakan
30       1.0       0.0                       Blackwell, Mr. Stephen Weart
...      ...       ...                                                ...
1269     3.0       0.0                   Vande Velde, Mr. Johannes Joseph
1270     3.0       0.0                     Vande Walle, Mr. Nestor Cyriel
1271     3.0       0.0                        Vanden Steen, Mr. Leo Peter
1272     3.0       0.0                        Vander Cruyssen, Mr. Victor
1273     3.0       0.0                 Vander Planke, Miss. Augusta Maria
1274     3.0       0.0                          Vander Planke, Mr. Julius
1275     3.0       0.0                    Vander Planke, Mr. Leo Edmondus
1276     3.0       0.0  Vander Planke, Mrs. Julius (Emelia Maria Vande...
1277     3.0       1.0                               Vartanian, Mr. David
1278     3.0       0.0                             Vendel, Mr. Olof Edvin
1279     3.0       0.0               Vestrom, Miss. Hulda Amanda Adolfina
1280     3.0       0.0                                    Vovk, Mr. Janko
1281     3.0       0.0                               Waelens, Mr. Achille
1285     3.0       0.0                                Wenzel, Mr. Linhart
1286     3.0       1.0    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1287     3.0       0.0                   Widegren, Mr. Carl/Charles Peter
1288     3.0       0.0                          Wiklund, Mr. Jakob Alfred
1289     3.0       0.0                            Wiklund, Mr. Karl Johan
1290     3.0       1.0                   Wilkes, Mrs. James (Ellen Needs)
1294     3.0       0.0                               Williams, Mr. Leslie
1295     3.0       0.0                                Windelov, Mr. Einar
1296     3.0       0.0                                   Wirz, Mr. Albert
1298     3.0       0.0                          Wittevrongel, Mr. Camille
1299     3.0       0.0                                Yasbeck, Mr. Antoni
1300     3.0       1.0            Yasbeck, Mrs. Antoni (Selini Alexander)
1301     3.0       0.0                               Youseff, Mr. Gerious
1304     3.0       0.0                               Zabour, Miss. Hileni
1306     3.0       0.0                          Zakarian, Mr. Mapriededer
1307     3.0       0.0                                Zakarian, Mr. Ortin
1308     3.0       0.0                                 Zimmerman, Mr. Leo

         sex      age  sibsp  parch            ticket      fare    cabin  \
0     female  29.0000    0.0    0.0             24160  211.3375       B5
1       male   0.9167    1.0    2.0            113781  151.5500  C22 C26
2     female   2.0000    1.0    2.0            113781  151.5500  C22 C26
3       male  30.0000    1.0    2.0            113781  151.5500  C22 C26
4     female  25.0000    1.0    2.0            113781  151.5500  C22 C26
5       male  48.0000    0.0    0.0             19952   26.5500      E12
6     female  63.0000    1.0    0.0             13502   77.9583       D7
7       male  39.0000    0.0    0.0            112050    0.0000      A36
8     female  53.0000    2.0    0.0             11769   51.4792     C101
9       male  71.0000    0.0    0.0          PC 17609   49.5042      NaN
10      male  47.0000    1.0    0.0          PC 17757  227.5250  C62 C64
11    female  18.0000    1.0    0.0          PC 17757  227.5250  C62 C64
12    female  24.0000    0.0    0.0          PC 17477   69.3000      B35
13    female  26.0000    0.0    0.0             19877   78.8500      NaN
14      male  80.0000    0.0    0.0             27042   30.0000      A23
16      male  24.0000    0.0    1.0          PC 17558  247.5208  B58 B60
17    female  50.0000    0.0    1.0          PC 17558  247.5208  B58 B60
18    female  32.0000    0.0    0.0             11813   76.2917      D15
19      male  36.0000    0.0    0.0             13050   75.2417       C6
20      male  37.0000    1.0    1.0             11751   52.5542      D35
21    female  47.0000    1.0    1.0             11751   52.5542      D35
22      male  26.0000    0.0    0.0            111369   30.0000     C148
23    female  42.0000    0.0    0.0          PC 17757  227.5250      NaN
24    female  29.0000    0.0    0.0          PC 17483  221.7792      C97
25      male  25.0000    0.0    0.0             13905   26.0000      NaN
26      male  25.0000    1.0    0.0             11967   91.0792      B49
27    female  19.0000    1.0    0.0             11967   91.0792      B49
28    female  35.0000    0.0    0.0          PC 17760  135.6333      C99
29      male  28.0000    0.0    0.0            110564   26.5500      C52
30      male  45.0000    0.0    0.0            113784   35.5000        T
...      ...      ...    ...    ...               ...       ...      ...
1269    male  33.0000    0.0    0.0            345780    9.5000      NaN
1270    male  28.0000    0.0    0.0            345770    9.5000      NaN
1271    male  28.0000    0.0    0.0            345783    9.5000      NaN
1272    male  47.0000    0.0    0.0            345765    9.0000      NaN
1273  female  18.0000    2.0    0.0            345764   18.0000      NaN
1274    male  31.0000    3.0    0.0            345763   18.0000      NaN
1275    male  16.0000    2.0    0.0            345764   18.0000      NaN
1276  female  31.0000    1.0    0.0            345763   18.0000      NaN
1277    male  22.0000    0.0    0.0              2658    7.2250      NaN
1278    male  20.0000    0.0    0.0            350416    7.8542      NaN
1279  female  14.0000    0.0    0.0            350406    7.8542      NaN
1280    male  22.0000    0.0    0.0            349252    7.8958      NaN
1281    male  22.0000    0.0    0.0            345767    9.0000      NaN
1285    male  32.5000    0.0    0.0            345775    9.5000      NaN
1286  female  38.0000    0.0    0.0              2688    7.2292      NaN
1287    male  51.0000    0.0    0.0            347064    7.7500      NaN
1288    male  18.0000    1.0    0.0           3101267    6.4958      NaN
1289    male  21.0000    1.0    0.0           3101266    6.4958      NaN
1290  female  47.0000    1.0    0.0            363272    7.0000      NaN
1294    male  28.5000    0.0    0.0             54636   16.1000      NaN
1295    male  21.0000    0.0    0.0  SOTON/OQ 3101317    7.2500      NaN
1296    male  27.0000    0.0    0.0            315154    8.6625      NaN
1298    male  36.0000    0.0    0.0            345771    9.5000      NaN
1299    male  27.0000    1.0    0.0              2659   14.4542      NaN
1300  female  15.0000    1.0    0.0              2659   14.4542      NaN
1301    male  45.5000    0.0    0.0              2628    7.2250      NaN
1304  female  14.5000    1.0    0.0              2665   14.4542      NaN
1306    male  26.5000    0.0    0.0              2656    7.2250      NaN
1307    male  27.0000    0.0    0.0              2670    7.2250      NaN
1308    male  29.0000    0.0    0.0            315082    7.8750      NaN

     embarked   boat   body                           home.dest
0           S      2    NaN                        St Louis, MO
1           S     11    NaN     Montreal, PQ / Chesterville, ON
2           S    NaN    NaN     Montreal, PQ / Chesterville, ON
3           S    NaN  135.0     Montreal, PQ / Chesterville, ON
4           S    NaN    NaN     Montreal, PQ / Chesterville, ON
5           S      3    NaN                        New York, NY
6           S     10    NaN                          Hudson, NY
7           S    NaN    NaN                         Belfast, NI
8           S      D    NaN                 Bayside, Queens, NY
9           C    NaN   22.0                 Montevideo, Uruguay
10          C    NaN  124.0                        New York, NY
11          C      4    NaN                        New York, NY
12          C      9    NaN                       Paris, France
13          S      6    NaN                                 NaN
14          S      B    NaN                       Hessle, Yorks
16          C    NaN    NaN                        Montreal, PQ
17          C      6    NaN                        Montreal, PQ
18          C      8    NaN                                 NaN
19          C      A    NaN                        Winnipeg, MN
20          S      5    NaN                        New York, NY
21          S      5    NaN                        New York, NY
22          C      5    NaN                        New York, NY
23          C      4    NaN                                 NaN
24          S      8    NaN                                 NaN
25          C    NaN  148.0                   San Francisco, CA
26          C      7    NaN                        Dowagiac, MI
27          C      7    NaN                        Dowagiac, MI
28          S      8    NaN                                 NaN
29          S      D    NaN  Stockholm, Sweden / Washington, DC
30          S    NaN    NaN                         Trenton, NJ
...       ...    ...    ...                                 ...
1269        S    NaN    NaN                                 NaN
1270        S    NaN    NaN                                 NaN
1271        S    NaN    NaN                                 NaN
1272        S    NaN    NaN                                 NaN
1273        S    NaN    NaN                                 NaN
1274        S    NaN    NaN                                 NaN
1275        S    NaN    NaN                                 NaN
1276        S    NaN    NaN                                 NaN
1277        C  13 15    NaN                                 NaN
1278        S    NaN    NaN                                 NaN
1279        S    NaN    NaN                                 NaN
1280        S    NaN    NaN                                 NaN
1281        S    NaN    NaN      Antwerp, Belgium / Stanton, OH
1285        S    NaN  298.0                                 NaN
1286        C      C    NaN                                 NaN
1287        S    NaN    NaN                                 NaN
1288        S    NaN  314.0                                 NaN
1289        S    NaN    NaN                                 NaN
1290        S    NaN    NaN                                 NaN
1294        S    NaN   14.0                                 NaN
1295        S    NaN    NaN                                 NaN
1296        S    NaN  131.0                                 NaN
1298        S    NaN    NaN                                 NaN
1299        C      C    NaN                                 NaN
1300        C    NaN    NaN                                 NaN
1301        C    NaN  312.0                                 NaN
1304        C    NaN  328.0                                 NaN
1306        C    NaN  304.0                                 NaN
1307        C    NaN    NaN                                 NaN
1308        S    NaN    NaN                                 NaN

[1046 rows x 14 columns]


### Select n first rows of a sorted dataframe
If we wanted to select the first five rows of an already sorted dataframe, we can **use DataFrame.iloc[] method to select by position**. The easy way to remember which is which is to remember that iloc[] stands for integer location, because you use integers and not labels to select the data.

DataFrame.loc[] would select by ID / Label

In [27]:
new_titanic_survival = titanic_survival.sort_values("age", axis=0, ascending=False, inplace=False)

example_loc = new_titanic_survival.loc[14]
example_iloc = new_titanic_survival.iloc[14]

print(example_loc)
print(example_iloc)

pclass                                          1
survived                                        1
name         Barkworth, Mr. Algernon Henry Wilson
sex                                          male
age                                            80
sibsp                                           0
parch                                           0
ticket                                      27042
fare                                           30
cabin                                         A23
embarked                                        S
boat                                            B
body                                          NaN
home.dest                           Hessle, Yorks
Name: 14, dtype: object
pclass                                                       1
survived                                                     1
name         Crosby, Mrs. Edward Gifford (Catherine Elizabe...
sex                                                     female
age                                                         64
sibsp                                                        1
parch                                                        1
ticket                                                  112901
fare                                                     26.55
cabin                                                      B26
embarked                                                     S
boat                                                         7
body                                                       NaN
home.dest                                        Milwaukee, WI
Name: 83, dtype: object

In [28]:
#Assign the first ten rows from new_titanic_survival to first_ten_rows.
first_ten_rows = new_titanic_survival.iloc[0:10]

#Assign the fifth row from new_titanic_survival to row_position_fifth.
row_position_fifth = new_titanic_survival.iloc[4]

#Assign the row with index label 25 from new_titanic_survivalto row_index_25.
row_index_25 = new_titanic_survival.loc[25]

We can also** index columns using both the loc[] and iloc[] methods**. 
- With .loc[], we specify the column label strings as we have in the earlier exercises in this missions. 
- With iloc[], we simply use the integer number of the column, starting from the left-most column which is 0. 

Similar to indexing with NumPy arrays, you separate the row and columns with a comma, and can use a colon to specify a range or as a wildcard.

In [32]:
first_row_first_column = new_titanic_survival.iloc[0,0] #index
all_rows_first_three_columns = new_titanic_survival.iloc[:,0:3] #index

row_index_83_age = new_titanic_survival.loc[83,"age"] #labels
row_index_766_pclass = new_titanic_survival.loc[766,"pclass"] #labels

row_index_1100_age = new_titanic_survival.loc[1100,"age"] #labels
row_index_25_survived = new_titanic_survival.loc[25,"survived"] #labels
five_rows_three_cols = new_titanic_survival.iloc[0:5,0:3] #index

Sometimes it's useful to **reindex, starting from 0**. We can use the **`DataFrame.reset_index()`** method to do this. By default, the method retains the old index by adding an extra column to the dataframe with the old index values

In [33]:
titanic_reindexed = new_titanic_survival.reset_index(drop = True) # overwriting existing index
print(titanic_reindexed.loc[0:5])

   pclass  survived                                               name  \
0     1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
1     1.0       1.0  Cavendish, Mrs. Tyrell William (Julia Florence...
2     3.0       0.0                                Svensson, Mr. Johan
3     1.0       0.0                          Goldschmidt, Mr. George B
4     1.0       0.0                            Artagaveytia, Mr. Ramon
5     3.0       0.0                               Connors, Mr. Patrick

      sex   age  sibsp  parch    ticket     fare cabin embarked boat   body  \
0    male  80.0    0.0    0.0     27042  30.0000   A23        S    B    NaN
1  female  76.0    1.0    0.0     19877  78.8500   C46        S    6    NaN
2    male  74.0    0.0    0.0    347060   7.7750   NaN        S  NaN    NaN
3    male  71.0    0.0    0.0  PC 17754  34.6542    A5        C  NaN    NaN
4    male  71.0    0.0    0.0  PC 17609  49.5042   NaN        C  NaN   22.0
5    male  70.5    0.0    0.0    370369   7.7500   NaN        Q  NaN  171.0

                 home.dest
0            Hessle, Yorks
1  Little Onn Hall, Staffs
2                      NaN
3             New York, NY
4      Montevideo, Uruguay
5                      NaN

## Dataframe.apply

To perform a complex calculation across pandas objects, we'll need to learn about the DataFrame.apply() method. By default, DataFrame.apply() will **iterate through each column in a DataFrame, and perform on each function**. When we create our function, we give it one parameter, apply() method passes each column to the parameter as a pandas series.

The result from the function will be **combined with all of the other results**, and placed **into a new series**. The function results will have the same position as the column or row we generated them from. Let's look at a simple example:

In [34]:
# This function returns the hundredth item from a series
def hundredth_elem(column):
    return column.iloc[99]

print(titanic_survival.apply(hundredth_elem))

pclass                                                       1
survived                                                     1
name         Duff Gordon, Lady. (Lucille Christiana Sutherl...
sex                                                     female
age                                                         48
sibsp                                                        1
parch                                                        0
ticket                                                   11755
fare                                                      39.6
cabin                                                      A16
embarked                                                     C
boat                                                         1
body                                                       NaN
home.dest                                       London / Paris
dtype: object

In [47]:
def count_null_values(column):
    #return(pd.isnull(column)[pd.isnull(column) == True]).shape[0]
    
    #better:
    return len(column[pd.isnull(column)])
    
column_null_count= titanic_survival.apply(count_null_values)
print(column_null_count)

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

By passing in the `axis=1` argument, we can use the DataFrame.apply() method to **iterate over rows instead of columns**.

In [58]:
def is_minor(row):
    if row["age"] < 18:
        return True
    else:
        return False

minors = titanic_survival.apply(is_minor, axis=1)
print(minors.head())

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [57]:
# Label if passengers are minors or not

def minor_label(row):
    age_obj = row["age"]
    #print(type(age))
    if pd.isnull(age_obj):
        return "unknown"
    elif age_obj >= 18:
        return "adult"
    else:
        return "minor"

age_labels = titanic_survival.apply(minor_label, axis=1)
print(age_labels.head())

0    adult
1    minor
2    minor
3    adult
4    adult
dtype: object